---
kind: method
id: M:Autodesk.Revit.DB.FormulaManager.GetOperators
source: html/17ce23d0-ba9a-34cb-6a5d-054aa381b2e5.htm
---
# Autodesk.Revit.DB.FormulaManager.GetOperators Method

Gets list of operator names supported by formula engine

## Syntax (C#)
```csharp
public static IList<string> GetOperators()
```